var beeper = require('beeper'); // дозволяє відтворювати звуковий сигнал

var TelegramBot = require('node-telegram-bot-api'); // дозволяє взаємодіяти з Telegram Bot API

var token = '5688291301:AAHbCK7aSoTvdCqwujdqeZmpBI4wCxTlcHg';

// Створюється новий екземпляр бота з використанням отриманого токену. У нашому випадку бот працюватиме в режимі опитування (polling: true), що означає, що він буде періодично перевіряти наявність нових повідомлень
var bot = new TelegramBot(token, {polling: true});

// Встановлюється обробник події message, який буде виконуватись при отриманні нового повідомлення
bot.on('message', function (msg) {

    // У внутрішньому коді обробника повідомлення отримується ідентифікатор чату, з якого було надіслано повідомлення
    var chatId = msg.chat.id;

    // Виводиться на консоль ім'я користувача, який надіслав повідомлення, з використанням зеленого кольору (за допомогою спеціальних символів ANSI)
    console.log("\x1b[36m%s\x1b[0m", "Ім'я: " + msg.from.first_name);
    
    // Виводиться на консоль текст повідомлення, з використанням жовтого кольору
    console.log("\x1b[33m%s\x1b[0m", "Повідомлення: " + msg.text);

    // Відтворюється звуковий сигнал двічі за допомогою модуля beeper
    beeper(2);

    // Відправляється відповідь користувачеві у той же чат з текстом "Hello!" і підписом "I'm a bot!"
    bot.sendMessage(chatId, "Hello! ", {caption: "I'm a bot!"});
});